This Notebook is a script that takes the csv datasets and load it into 
the MYSQL workbench realtions fot a database calles shoppingcart

In [76]:
!pip install randomtimestamp

Requirement already satisfied: randomtimestamp in c:\users\user\appdata\local\programs\python\python310\lib\site-packages (2.2)

[notice] A new release of pip available: 22.3 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [77]:
import pandas as pd
from sqlalchemy import create_engine
import sqlalchemy
from randomtimestamp import randomtimestamp

In [78]:
DB_PASSWORD = ''
DB_NAME = 'adb_opt_2M'
input_folder = 'data_2000000'
engine = create_engine(f'mysql+pymysql://root:{DB_PASSWORD}@localhost:3306/{DB_NAME}')
connection = engine.connect()

In [79]:
customer_df = pd.read_csv(f'{input_folder}/customers.csv')
customer_df.head()

   ID governorate  age             name  gender
0   1      Assiut   45      Diane Parks       0
1   2       Luxor   31     Joe Chambers       0
2   3   Qaliubiya   66      Jamie David       1
3   4     Matrouh   66  Felicia Cabrera       1
4   5      Assiut   35    John Hamilton       1

In [80]:
len(customer_df)

2000000

In [81]:
products_df = pd.read_csv(f'{input_folder}/products.csv')

In [82]:
orders_uncomplete_df = pd.read_csv(f'{input_folder}/orders.csv')

In [83]:
suppliers_df = pd.read_csv(f'{input_folder}/suppliers.csv')

In [84]:
order_items_df = pd.read_csv(f'{input_folder}/order_items.csv')

In [85]:
ratings_df = pd.read_csv(f'{input_folder}/ratings.csv')

In [86]:
# Calculate the total price of an order
# Merge the product table with the order_item table
order_item_product = order_items_df.merge(products_df, right_on='ID', left_on='product_id', how='left')[['order_id', 'quantity', 'price']]
# Mulitply the price of the product with its quantity
order_item_product['order_time_price'] = order_item_product['price']*order_item_product['quantity']
# Sum the order-item's prices of the same order together 
order_item_product = order_item_product.groupby(['order_id']).agg({'order_time_price':'sum'}).rename(columns={'order_time_price':'total_price'}).reset_index()
orders_df = orders_uncomplete_df.merge(order_item_product, right_on='order_id', left_on='ID', how='outer').drop(['order_id'], axis=1)
# Set zero price for Orders with no order-items
orders_df['total_price'] = orders_df['total_price'].fillna(0)
orders_df.head()

        ID  customer_id        date  hour  total_price
0  1290241         1034  2018-12-05     7          0.0
1  1694384         4481  2017-12-30    18          0.0
2  1311561         1120  2013-01-14     8          0.0
3  1268321          569  2014-01-27     8          0.0
4  1821168         2491  2012-11-28     2          0.0

In [87]:
def put_rand_timestamp(val):
    return randomtimestamp(start_year=2020, end_year=2021, text=True)
    
orders_df['ordered_at'] = None
orders_df['ordered_at'] = orders_df['ordered_at'].apply(put_rand_timestamp)
orders_df.head()

        ID  customer_id        date  hour  total_price           ordered_at
0  1290241         1034  2018-12-05     7          0.0  24-06-2021 00:32:15
1  1694384         4481  2017-12-30    18          0.0  06-12-2021 07:20:51
2  1311561         1120  2013-01-14     8          0.0  20-03-2020 10:15:55
3  1268321          569  2014-01-27     8          0.0  21-02-2021 13:01:04
4  1821168         2491  2012-11-28     2          0.0  16-05-2020 13:04:28

In [88]:
customer_df.to_sql('customers', con=connection, if_exists='replace',index=False, method=None,dtype={
    'ID': sqlalchemy.types.Integer,
    'governorate': sqlalchemy.types.Enum('Alexandria', 'Aswan', 'Asyut', 'Beheira', 'Beni Suef', 'Cairo', 'Dakahlia', 'Damietta', 'Faiyum', 'Gharbia', 'Giza', 'Ismailia', 'Kafr El Sheikh', 'Luxor', 'Matruh', 'Minya', 'Monufia', 'New Valley', 'North Sinai', 'Port Said', 'Qalyubia', 'Qena', 'Red Sea', 'Sharqia', 'Sohag', 'South Sinai', 'Suez', 'Other'),
    'age': sqlalchemy.types.SmallInteger,
    'name': sqlalchemy.types.VARCHAR(100),
    'gender': sqlalchemy.types.BOOLEAN
})
products_df.to_sql('products', con=connection, if_exists='replace',index=False, method=None,dtype={
    'ID': sqlalchemy.types.Integer,
    'product_name': sqlalchemy.types.VARCHAR(100),
    'price': sqlalchemy.types.Float,
    'category': sqlalchemy.types.Integer,
    'supplier_id': sqlalchemy.types.Integer
    })
orders_df.to_sql('orders', con=connection, if_exists='replace',index=False, method=None,dtype={
    'ID': sqlalchemy.types.Integer,
    'customer_id': sqlalchemy.types.Integer,
    'ordered_at': sqlalchemy.types.DateTime, # concat date and time
    'total_price': sqlalchemy.types.Float  # sum of all order_item price in order
})
suppliers_df.to_sql('suppliers', con=connection, if_exists='replace',index=False, method=None,dtype={
    'ID': sqlalchemy.types.Integer,
    'name': sqlalchemy.types.VARCHAR(100) # need to specify that it is unique
})
order_items_df.to_sql('order_items', con=connection, if_exists='replace',index=False, method=None, dtype={
    'order_id': sqlalchemy.types.Integer,
    'product_id': sqlalchemy.types.Integer,
    'quantity': sqlalchemy.types.SMALLINT # tiny int holds uptill 255 which is enough for a quantity 
})
ratings_df.to_sql('ratings', con=connection, if_exists='replace',index=False, method=None, dtype={
    'product_id' : sqlalchemy.types.Integer,
    'customer_id' : sqlalchemy.types.Integer,
    'rating' : sqlalchemy.types.SMALLINT # holds uptill 0-32,000
                         # I am not sure would this work or not
})

2000000

In [89]:
"""
Tables definitions:

"""

'\nTables definitions:\n\n'

In [90]:
# adding th primary keys
connection.execute("ALTER TABLE customers ADD PRIMARY KEY (ID);")
connection.execute("ALTER TABLE products ADD PRIMARY KEY (ID);")
connection.execute("ALTER TABLE orders ADD PRIMARY KEY (ID);")
connection.execute("ALTER TABLE suppliers ADD PRIMARY KEY (ID);")
connection.execute("ALTER TABLE order_items ADD PRIMARY KEY (order_id, product_id);")
connection.execute("ALTER TABLE ratings ADD PRIMARY KEY (customer_id, product_id);")

# adding the foreign keys
connection.execute("ALTER TABLE order_items ADD FOREIGN KEY (order_id) REFERENCES orders(ID);")
connection.execute("ALTER TABLE order_items ADD FOREIGN KEY (product_id) REFERENCES products(ID);")
connection.execute("ALTER TABLE products ADD FOREIGN KEY (supplier_id) REFERENCES suppliers(ID);")
connection.execute("ALTER TABLE orders ADD FOREIGN KEY (customer_id) REFERENCES customers(ID);")
connection.execute("ALTER TABLE ratings ADD FOREIGN KEY (customer_id) REFERENCES customers(ID);")
connection.execute("ALTER TABLE ratings ADD FOREIGN KEY (product_id) REFERENCES products(ID);")

# adding unique constraints
# connection.execute("ALTER TABLE products ADD UNIQUE (product_name);")
connection.execute("ALTER TABLE suppliers ADD UNIQUE (name);")

# closing the connection
connection.close()